#!/usr/bin/env python
# -*- coding:utf-8 -*-
# Author:Charioty
# time:2019/6/28
from collections import Counter
import numpy

jin = ['铵', '钡', '钹', '铂', '镔', '镖', '丞', '乘', '产', '仇', '仓', '侪', '促', '倡', '偿', '储', '册', '冲', '出', '刍', '创', '初', '参', '唱', '宠', '宸', '察', '寸', '崇', '崈', '川', '帱', '常', '忱', '愁', '慈', '憧', '成', '才', '承', '持', '措', '操', '敞', '昌', '春', '晁', '晨', '曹', '曾', '朝', '查', '次', '此', '珵', '珹', '琛', '琤', '琩', '琮', '玚', '璀', '璨', '瓷', '畴', '睬', '矗', '禅', '穿', '窗', '纯', '绸', '聪', '臣', '舂', '舱', '船', '蚕', '蚩', '蝉', '蟾', '衬', '词', '诚', '诧', '谌', '财', '赐', '赤', '超', '躇', '车', '辞', '迟', '酬', '钏', '钗', '锄', '锤', '雏', '兑', '刀', '度', '得', '瑖', '貂', '钓', '钿', '铎', '铫', '锭', '锻', '镀', '雕', '雼', '靛', '儿', '皒', '而', '贰', '锇', '敷', '珐', '珐', '钒', '钫', '锋', '倝', '刚', '宫', '庚', '戈', '暠', '玕', '珖', '珪', '罡', '钢', '锆', '镐', '划', '徽', '环', '郝', '锾', '净', '剑', '寂', '峻', '捷', '旌', '玠', '玾', '珒', '珓', '瑨', '璟', '璥', '竣', '聚', '节', '辑', '金', '鉴', '钧', '铰', '锦', '键', '镌', '镓', '镜', '靓', '靖', '静', '侃', '剀', '勘', '铠', '铿', '屡', '率', '銮', '铃', '铼', '链', '镂', '镭', '镰', '闾', '铭', '锚', '锰', '镁', '倪', '宁', '钮', '铌', '凭', '铺', '七', '仟', '佺', '倩', '千', '取', '忴', '情', '憇', '氢', '謦', '迁', '钤', '钦', '钱', '铅', '铨', '锲', '锵', '锹', '雀', '青', '人', '仁', '仍', '仞', '任', '儒', '入', '柔', '瑞', '瑢', '睿', '绒', '衽', '襦', '认', '轫', '锐', '镕', '三', '上', '世', '丝', '书', '事', '什', '仕', '伸', '俗', '僧', '僳', '兟', '劭', '势', '十', '升', '双', '叔', '受', '史', '司', '商', '善', '宋', '实', '审', '寔', '寿', '少', '尚', '岁', '帅', '师', '庶', '思', '慎', '抒', '授', '揌', '数', '斯', '施', '时', '是', '昰', '束', '殊', '氏', '爽', '狮', '珅', '珊', '琗', '甚', '生', '甡', '甥', '申', '盛', '睢', '瞬', '社', '神', '竦', '纾', '绅', '绍', '绶', '缮', '耸', '肃', '胜', '舍', '舒', '舜', '蜀', '设', '识', '诗', '说', '诵', '谂', '谥', '赏', '赛', '身', '轼', '述', '速', '邃', '邵', '酥', '释', '钐', '铄', '锁', '锶', '闪', '韶', '顺', '推', '替', '童', '途', '钛', '铁', '铜', '锬', '镗', '玟', '问', '仙', '信', '修', '僖', '先', '兮', '叙', '宣', '宵', '小', '巡', '席', '序', '庥', '徐', '心', '性', '悉', '想', '惺', '新', '旋', '旬', '星', '晰', '暄', '暹', '歆', '犀', '珛', '珨', '祥', '纤', '线', '细', '绚', '绣', '绪', '续', '羲', '胥', '舷', '衔', '袖', '西', '询', '详', '谖', '辛', '选', '逊', '逍', '醒', '鑫', '铉', '锌', '锡', '俞', '悦', '愈', '愉', '愔', '曳', '玗', '珆', '瑜', '舆', '裕', '译', '谒', '谕', '逾', '酉', '鋆', '钥', '钰', '铱', '银', '镒', '专', '主', '众', '佐', '作', '兹', '再', '则', '助', '宗', '宙', '宰', '尊', '峙', '州', '帜', '帧', '庄', '总', '战', '扎', '拙', '拯', '挚', '攒', '整', '斋', '族', '早', '昨', '昼', '枣', '栽', '正', '珘', '珠', '琸', '瑧', '瓒', '真', '睁', '祖', '组', '织', '综', '缜', '臧', '舟', '着', '诏', '诸', '谆', '贮', '资', '赜', '赞', '走', '载', '造', '遵', '酌', '铚', '针', '钊', '钟', '钲', '钻', '铮', '铸', '镇']
mu = ['桉', '本', '杓', '杯', '柄', '柏', '标', '栟', '棒', '榜', '槟', '笆', '笔', '芭', '苄', '苞', '苪', '苾', '荜', '荸', '荹', '葆', '蓓', '蔀', '材', '村', '枞', '枨', '柴', '柽', '梣', '棌', '椆', '椽', '椿', '楚', '楮', '槎', '槯', '樗', '橙', '笒', '策', '筹', '簇', '苁', '苌', '苍', '茞', '茨', '茬', '茶', '草', '莀', '莐', '莼', '菖', '萃', '萗', '蔟', '蔡', '藏', '趁', '朵', '杜', '栋', '棣', '椴', '稻', '笃', '笗', '笛', '第', '等', '答', '簟', '芏', '苳', '荙', '荻', '菂', '菪', '葮', '蒂', '迭', '荋', '莪', '萼', '轭', '枋', '枫', '梵', '棼', '樊', '符', '筏', '粉', '芙', '芣', '芬', '芳', '芾', '苻', '茯', '莩', '菲', '葑', '蕃', '杲', '构', '果', '枸', '根', '格', '桂', '桄', '桧', '概', '歌', '管', '耕', '舸', '茥', '茪', '莞', '菇', '葛', '蒄', '蓕', '观', '规', '觏', '谷', '赣', '躬', '辊', '轨', '辊', '过', '杭', '桁', '桓', '桦', '梒', '梡', '槐', '横', '秴', '篁', '花', '茴', '荒', '荟', '荭', '荷', '莟', '获', '菡', '萂', '葟', '蕙', '藿', '蘅', '虹', '赫', '机', '杰', '极', '枧', '栫', '桀', '桔', '桷', '检', '椈', '椐', '楗', '楫', '榉', '榘', '槿', '橘', '檞', '稷', '稼', '稽', '笄', '笳', '笺', '简', '箕', '箭', '籍', '舰', '艽', '芥', '苣', '苴', '茭', '荐', '荠', '荩', '莒', '菁', '菅', '菊', '葭', '蒟', '蒹', '蕉', '藠', '蛟', '见', '觉', '觐', '角', '近', '迥', '迦', '隽', '集', '柯', '楷', '款', '科', '筐', '肯', '萪', '葵', '轲', '林', '枥', '柳', '栊', '栗', '棱', '楼', '榄', '榈', '榔', '榴', '橹', '笠', '笭', '篮', '篱', '籁', '联', '芦', '苓', '荔', '荦', '莅', '莉', '莨', '莱', '莲', '菉', '菱', '萝', '葎', '蓝', '蓼', '蕾', '藜', '木', '枚', '梅', '梦', '棉', '楙', '楣', '模', '檬', '芒', '苜', '茂', '茅', '茉', '茗', '莓', '莽', '萌', '蔓', '柅', '柠', '楠', '朴', '杷', '枇', '枰', '棚', '盘', '篇', '芃', '苹', '莆', '莑', '葡', '蒲', '蓬', '权', '杞', '桤', '桥', '棋', '棨', '楸', '樯', '樵', '檠', '筌', '箐', '芊', '芑', '芩', '芪', '芹', '茜', '荃', '荞', '萁', '蒨', '蔷', '蕖', '虬', '起', '轻', '逑', '遒', '榕', '苒', '若', '茸', '茹', '荏', '荛', '荣', '葇', '蓉', '蕊', '蕤', '薷', '术', '杉', '松', '枢', '柿', '树', '栓', '桑', '梢', '梭', '森', '笙', '笥', '芍', '苏', '苕', '苼', '荪', '莎', '莘', '莳', '菘', '菽', '萨', '葹', '蔬', '桃', '桐', '梃', '梯', '棠', '楟', '檀', '苔', '荑', '莛', '萄', '藤', '未', '桅', '梧', '芄', '芜', '芠', '苇', '菀', '葳', '蔚', '薇', '杏', '析', '栒', '校', '栩', '械', '楦', '榭', '樨', '檄', '欣', '歇', '相', '稀', '筱', '箫', '肖', '芗', '芯', '苋', '荀', '萧', '萱', '蓄', '薛', '薪', '藓', '杨', '柚', '样', '桠', '棫', '椅', '楹', '榆', '樱', '毅', '竽', '筠', '筵', '聿', '胤', '艺', '芋', '芫', '芸', '芽', '苑', '苡', '英', '茚', '茵', '荫', '荶', '荺', '莹', '莺', '萤', '营', '萦', '萸', '蕴', '薏', '遇', '雁', '雅', '朱', '杼', '枝', '枳', '柞', '柱', '栅', '栈', '栉', '株', '桢', '梓', '棕', '棹', '植', '榛', '樟', '樽', '稕', '竹', '竺', '笮', '筑', '箴', '簪', '芝', '芷', '苎', '苎', '茁', '茱', '茽', '荢', '荮', '莋', '葃', '蒸', '蓁']
shui = ['澳', '伯', '伴', '保', '倍', '冰', '汴', '波', '渤', '滨', '畀', '白', '百', '碧', '祊', '禀', '箔', '缤', '般', '舶', '菠', '补', '表', '裱', '褒', '褓', '豹', '贝', '跋', '辈', '辨', '边', '逋', '邠', '邦', '邴', '邶', '部', '钚', '陂', '颁', '飑', '飙', '飚', '驳', '骠', '鲍', '汌', '池', '沉', '沧', '浺', '涔', '淐', '淙', '淬', '淳', '潮', '潺', '澄', '澈', '醇', '洞', '涤', '淀', '淡', '渡', '滇', '点', '荡', '洱', '付', '份', '仿', '伏', '伐', '佛', '俯', '俸', '傅', '冯', '汾', '沣', '沨', '法', '泛', '浮', '涪', '父', '甫', '福', '繁', '纷', '纺', '绂', '缚', '翡', '翻', '肪', '舫', '艴', '范', '藩', '蜂', '访', '赋', '辅', '逢', '郛', '釜', '阜', '防', '霏', '非', '俯', '风', '飞', '馡', '馥', '驸', '鲂', '汩', '汵', '洸', '港', '澉', '虢', '阁', '互', '亥', '亨', '会', '侯', '候', '汇', '汉', '沆', '沪', '河', '泓', '洪', '洹', '活', '浍', '浑', '浒', '浛', '浣', '浩', '海', '涆', '涣', '涥', '涵', '淮', '渱', '湖', '滉', '潢', '澔', '澕', '濠', '瀚', '灏', '痕', '皇', '祜', '红', '绗', '绘', '罕', '翮', '翰', '航', '菏', '虎', '豪', '贺', '轰', '辉', '还', '遑', '邗', '邯', '合', '郇', '酣', '霍', '韩', '颔', '魂', '鸿', '鹤', '江', '泂', '泇', '泾', '洁', '洊', '洚', '津', '浃', '济', '浚', '涓', '涧', '渐', '湝', '滐', '瀞', '炬', '茳', '荆', '袓', '计', '贾', '霁', '鸠', '况', '邟', '阔', '冷', '凛', '沦', '泠', '泷', '洌', '洛', '流', '浏', '浪', '涟', '淋', '渌', '潞', '潾', '澜', '澧', '濂', '粱', '雷', '霖', '露', '买', '亩', '沐', '沔', '沫', '泯', '洺', '淼', '渺', '湄', '溟', '满', '漠', '漫', '蒙', '牟', '牧', '猛', '盟', '目', '眉', '眠', '眸', '瞄', '矛', '米', '绵', '缅', '缦', '美', '脉', '苗', '莫', '蒙', '蜜', '袤', '觅', '谋', '谟', '谧', '貌', '贸', '迈', '迷', '邈', '酩', '门', '闵', '闽', '陌', '马', '鸣', '麦', '麻', '凝', '泞', '泥', '浓', '湳', '霓', '丕', '仆', '佩', '沛', '泊', '泙', '泡', '泮', '派', '浦', '湃', '溥', '滂', '漂', '潘', '澎', '濮', '瓶', '畔', '皮', '盘', '盼', '缥', '翩', '聘', '萍', '评', '谱', '蹼', '配', '陪', '雱', '霈', '颇', '频', '骈', '鹏', '凊', '沁', '泉', '洽', '浅', '淇', '清', '渠', '溱', '潜', '裘', '汝', '洳', '润', '溶', '濡', '水', '汕', '沈', '沙', '泗', '洒', '淑', '淞', '深', '湜', '溯', '漱', '澍', '绥', '隃', '霜', '飒', '汀', '汤', '沱', '洮', '涂', '涛', '淘', '添', '湉', '滔', '潭', '潼', '盷', '霆', '万', '汍', '汪', '汶', '沃', '沩', '洧', '涴', '渥', '渭', '湾', '潍', '物', '纹', '闻', '隈', '雯', '雾', '习', '乡', '享', '休', '兴', '汐', '汛', '泫', '洗', '洵', '淅', '渲', '湑', '湘', '溆', '溪', '漩', '潇', '熊', '熏', '熙', '玄', '睎', '禧', '荥', '虚', '行', '训', '闲', '雄', '雪', '霄', '霞', '项', '香', '云', '永', '沂', '沅', '沿', '泱', '泳', '洇', '洋', '浴', '涌', '涯', '渊', '渔', '渝', '游', '溎', '源', '溢', '滟', '滢', '演', '漪', '漾', '潆', '瀛', '盈', '矞', '耘', '艗', '衍', '赟', '郁', '雨', '雩', '霙', '鱼', '汋', '治', '沼', '沾', '注', '泽', '洲', '浙', '淄', '湛', '滋', '濯', '煮', '状', '藻', '震', '沾']
huo = ['皑', '丙', '佰', '宝', '摆', '炳', '焙', '丛', '从', '传', '呈', '尘', '彨', '彻', '掣', '敕', '晟', '灿', '炽', '焠', '焯', '灿', '畅', '瞅', '程', '绰', '翀', '裎', '褚', '踆', '踌', '逞', '采', '阐', '陈', '除', '丁', '丹', '亶', '代', '佃', '侗', '傣', '儋', '党', '典', '冬', '玬', '单', '叠', '多', '大', '妲', '娣', '宕', '定', '对', '导', '底', '当', '待', '德', '戴', '敦', '斗', '旦', '昸', '段', '殿', '灯', '焘', '狄', '甸', '登', '的', '盾', '督', '端', '缎', '缔', '耽', '聃', '胆', '舵', '蛋', '蝶', '读', '谛', '豆', '蹈', '达', '迪', '道', '邓', '郸', '都', '队', '顶', '顿', '黛', '鼎', '二', '尔', '耳', '迩', '丰', '昉', '烽', '燔', '光', '姯', '炔', '耿', '娢', '昊', '晃', '晗', '曷', '湟', '火', '烘', '焓', '焕', '煌', '熀', '皞', '缓', '翃', '钬', '俊', '厥', '奖', '姐', '姞', '将', '晋', '晶', '炅', '炯', '烄', '颎', '爵', '矍', '积', '绩', '践', '进', '迹', '际', '嫝', '恺', '昆', '焜', '两', '临', '丽', '乐', '了', '亮', '仑', '令', '伦', '伶', '侣', '俐', '俪', '六', '凉', '刘', '利', '卢', '历', '厉', '另', '吕', '姈', '娄', '娌', '娳', '庐', '录', '律', '怜', '恋', '抡', '拉', '斓', '旅', '朗', '李', '来', '梁', '梨', '灵', '炉', '炓', '炼', '烈', '犁', '瓴', '留', '略', '睐', '礼', '禄', '离', '立', '粮', '粼', '纶', '练', '绫', '绿', '缭', '罗', '羚', '翎', '聆', '腊', '良', '览', '论', '谅', '赖', '路', '轮', '辂', '辽', '连', '邻', '郎', '郦', '里', '量', '阆', '陆', '陇', '陵', '隆', '隶', '雳', '零', '领', '龄', '龙', '姳', '嫚', '旻', '睦', '乃', '侬', '内', '农', '南', '囡', '奈', '女', '奴', '妮', '娘', '娜', '娘', '宁', '寍', '年', '弄', '念', '恁', '拿', '暖', '男', '纳', '耐', '能', '讷', '诺', '辇', '那', '鼐', '庞', '肨', '飘', '全', '晴', '求', '秦', '冉', '日', '热', '熔', '稔', '让', '闰', '勺', '恕', '摄', '朔', '烁', '燧', '裳', '适', '遂', '亭', '仝', '体', '佟', '倓', '倜', '停', '厅', '台', '同', '听', '唐', '团', '图', '天', '太', '头', '妥', '婷', '庭', '廷', '彤', '徒', '恬', '悌', '惕', '托', '抟', '拓', '挺', '旲', '昙', '泰', '滕', '煓', '特', '甜', '田', '町', '畋', '瞳', '绦', '缇', '腾', '艇', '誊', '谈', '谭', '跳', '逖', '通', '醍', '闼', '陀', '陶', '韬', '题', '午', '炆', '炜', '畹', '罔', '顽', '夏', '妡', '妶', '嫙', '寻', '循', '昕', '显', '晓', '晞', '曦', '炘', '炫', '烋', '烜', '焮', '煊', '熹', '燮', '襄', '讯', '迅', '佁', '媛', '弋', '徭', '扬', '摇', '易', '昜', '映', '昱', '晔', '曜', '曣', '毓', '浥', '炀', '炎', '烟', '烨', '焰', '焱', '煜', '熠', '燠', '爻', '秧', '窈', '繇', '绎', '耀', '虞', '赢', '轶', '轺', '遥', '鞅', '颙', '中', '之', '争', '仲', '住', '侦', '倬', '值', '兆', '卓', '只', '召', '哲', '奏', '姊', '宅', '彰', '征', '征', '志', '忠', '执', '招', '择', '振', '撰', '支', '政', '旨', '昭', '昮', '晢', '晸', '智', '朕', '止', '灶', '灼', '照', '盏', '直', '瞻', '知', '祉', '祝', '祯', '种', '秩', '站', '章', '纵', '职', '胄', '自', '至', '致', '臻', '衷', '詹', '证', '诤', '贞', '质', '贽', '赵', '足', '转', '轴', '轸', '辙', '郅', '重', '长', '阵', '雉']
tu = ['傲', '凹', '埃', '奥', '安', '敖', '爱', '瑷', '盎', '艾', '谙', '遨', '阿', '鞍', '骜', '鳌', '坂', '堡', '壁', '璧', '碚', '礡', '蹦', '阪', '充', '城', '埕', '墀', '嵢', '嶒', '昶', '础', '磁', '辰', '邨', '地', '堆', '堤', '塅', '墩', '岽', '嶝', '巅', '砥', '碟', '翟', '诞', '峨', '恩', '坊', '矾', '砜', '翂', '附', '圭', '垓', '岗', '崮', '惯', '硌', '羾', '艮', '闺', '傐', '堭', '壑', '壕', '峘', '崡', '嵈', '画', '翙', '胡', '衡', '袔', '褘', '话', '鷨', '鸻', '黄', '均', '基', '堦', '境', '墐', '峤', '峧', '崌', '崛', '崨', '嵹', '己', '畯', '疆', '矶', '翞', '袺', '坎', '块', '坤', '垦', '垲', '堃', '奎', '岿', '崑', '嵑', '嵙', '矿', '逵', '坜', '垅', '垒', '屴', '岚', '岦', '岭', '崚', '嵂', '嶙', '疄', '砺', '砻', '砾', '磊', '褛', '岷', '嵋', '牡', '磨', '袂', '喦', '坭', '袅', '鸟', '欧', '鸥', '坡', '坪', '埔', '培', '磐', '切', '圻', '埼', '墙', '墝', '岍', '岐', '峭', '崎', '嵚', '牵', '确', '碁', '侞', '壤', '容', '嵘', '融', '似', '圣', '埏', '塾', '山', '崧', '嵩', '戍', '硕', '土', '坛', '坦', '埮', '堂', '塘', '眺', '窕', '褆', '丸', '为', '伍', '伟', '位', '兀', '卫', '呜', '唯', '围', '圩', '完', '宛', '尉', '崴', '巍', '帏', '帷', '徫', '惟', '慰', '戊', '旺', '温', '王', '玮', '琬', '瓦', '畏', '稳', '纬', '维', '翁', '胃', '谓', '豌', '韦', '勋', '勖', '型', '埙', '岘', '岫', '峋', '峡', '戌', '瑕', '翔', '翕', '诩', '轩', '遐', '顼', '一', '与', '丫', '乙', '也', '予', '于', '亚', '亦', '亿', '以', '伊', '优', '佑', '余', '佚', '侑', '依', '俑', '允', '养', '冶', '勇', '医', '原', '又', '友', '右', '叶', '员', '咏', '喁', '因', '园', '囿', '圆', '圯', '垚', '垠', '垣', '埜', '域', '堉', '堰', '墉', '壅', '壹', '夜', '央', '夷', '婴', '宇', '宥', '宴', '寅', '尤', '尹', '屹', '屿', '岩', '峄', '崖', '崟', '嵃', '嵎', '幼', '幽', '应', '庸', '延', '异', '引', '彝', '彧', '影', '忆', '怡', '怿', '恽', '悠', '意', '懿', '抑', '拥', '揖', '援', '攸', '旖', '昀', '晏', '有', '欲', '殷', '氤', '焉', '燕', '爰', '犹', '猷', '玥', '瑛', '璎', '用', '甬', '由', '益', '眙', '矣', '砚', '禹', '约', '缘', '缨', '羊', '羭', '羽', '翌', '耶', '育', '膺', '艳', '衣', '袁', '裔', '褕', '要', '誉', '诒', '诣', '豫', '贻', '越', '跃', '踊', '辕', '迎', '运', '远', '逸', '邑', '邺', '郓', '郧', '鄞', '野', '阅', '阳', '院', '隐', '雍', '韫', '音', '韵', '颐', '饮', '饴', '馀', '鸢', '鸳', '鹦', '仔', '准', '圳', '增', '峥', '嵫', '嶂', '稚', '轾']

def get_count_by_counter(element):
    sortele = []
    mins = []
    maxs = []
    sortNum = [0,0,0,0,0]
    elemen = [0,0]
    J=0
    M=0
    S=0
    H=0
    T=0
    for n in element:
        if n == '金':
            J=J+1
        elif n == '木':
            M=M+1
        elif n == '水':
            S=S+1
        elif n == '火':
            H=H+1
        elif n == '土':
            T=T+1
        sortNum[0] = J
        sortNum[1] = M
        sortNum[2] = S
        sortNum[3] = H
        sortNum[4] = T
    if 0 in sortNum:
        for i, j in enumerate(sortNum):
            if j == 0 :
                mins.append(i)
        for n in mins:
            if n == 0:
                sortele.append('缺金')
            elif n == 1:
                sortele.append('缺木')
            elif n == 2:
                sortele.append('缺水')
            elif n == 3:
                sortele.append('缺火')
            elif n == 4:
                sortele.append('缺土')
        if numpy.argmax(sortNum) == 0:
            sortele.append('多金')
        elif numpy.argmax(sortNum) == 1:
            sortele.append('多木')
        elif numpy.argmax(sortNum) == 2:
            sortele.append('多水')
        elif numpy.argmax(sortNum) == 3:
            sortele.append('多火')
        elif numpy.argmax(sortNum) == 4:
            sortele.append('多土')
    else:
        sortele.append('五行不缺')
        if 4 in sortNum or 3 in sortNum:
            for i, j in enumerate(sortNum):
                if j == 4:
                    maxs.append(i)
                elif j == 3:
                    maxs.append(i)
                else:
                    continue
            for n in maxs:
                if n == 0:
                    sortele.append('多金')
                elif n == 1:
                    sortele.append('多木')
                elif n == 2:
                    sortele.append('多水')
                elif n == 3:
                    sortele.append('多火')
                elif n == 4:
                    sortele.append('多土')
        else:
            sortele.append('八字平衡')
    elemen[-1] = sortele[-1]
    sortele.pop()
    Y=""
    for i in sortele:
        Y=Y+str(i)
    elemen[0]=Y
    return elemen

def choose_el(element):
    ele=[[],[]]
    if '缺金'in get_count_by_counter(element)[0]:
        ele[0].append('金')
        ele[1].append(jin)
    if '缺木' in get_count_by_counter(element)[0]:
        ele[0].append('木')
        ele[1].append(mu)
    if '缺水'in get_count_by_counter(element)[0]:
        ele[0].append('水')
        ele[1].append(shui)
    if '缺火' in get_count_by_counter(element)[0]:
        ele[0].append('火')
        ele[1].append(huo)
    if '缺土' in get_count_by_counter(element)[0]:
        ele[0].append('土')
        ele[1].append(tu)
    if '五行不缺' in get_count_by_counter(element)[0]:
        if '多金' in get_count_by_counter(element)[-1]:
            ele[0].append('火')
            ele[1].append(huo)
        if '多木' in get_count_by_counter(element)[-1]:
            ele[0].append('金')
            ele[1].append(jin)
        if '多水' in get_count_by_counter(element)[-1]:
            ele[0].append('土')
            ele[1].append(tu)
        if '多火' in get_count_by_counter(element)[-1]:
            ele[0].append('水')
            ele[1].append(shui)
        if '多土' in get_count_by_counter(element)[-1]:
            ele[0].append('木')
            ele[1].append(mu)
        if '八字平衡' in get_count_by_counter(element)[-1]:
            ele[0].append('不缺不多')
            ele[1].append('你什么都不缺，什么多不多，起名还不随意吗？')
    return ele
def elements(element):
    elements=['五行：',element,'\n','\n','圆缺： ',get_count_by_counter(element)[0],get_count_by_counter(element)[-1],'\n','\n','五行属',choose_el(element)[0],'的字:','\n','\n',choose_el(element)[1]]
    return elements
